{ 
  "meta": { "theme": "kwan" },
  "basics": {
    "name": "Mikey Wagner",
    "label": "Front End Developer",
    "picture": "images/mikey-red.jpg",
    "email": "wagnerdmike@gmail.com",
    "summary": "Front End Developer with a love for spicy foods, problem solving, and discovering new music.",
    "background": "Recently, I delivered a highly collaborative and scaled game where Google developers could reveal the date for the upcoming I/O conference by solving interactive puzzles. Previously, I have rapidly architected, implemented, and delivered responsive applications under tight deadlines using Scrum methodologies for companies like Honda, AT&T, AWS, and Intuit. During my time working with Honda, I was given the task of building a prototype for their upcoming car’s dashboard experience, and got to collaborate with the small R&D team. Additionally I was part of the team that built an enterprise level application for AT&T to help businesses dynamically select and configure complex VPN packages.",
    "location": {
      "city": "Los Angeles",
      "countryCode": "US",
      "region": "California"
    },
    "profiles": [
      {
        "network": "Instagram",
        "username": "mikeythekid",
        "url": "https://instagram.com/mikeythekid"
      },
      {
        "network": "Linkedin",
        "username": "mikeywagner",
        "url": "https://www.linkedin.com/in/mikeywagner/"
      },
      {
        "network": "Github",
        "username": "michaelwagner",
        "url": "https://github.com/michaelWagner"
      }
    ]
  },
  "work": [
    {
      "company": "Left Field Labs",
      "position": "Front End Developer (Google Contractor)",
      "website": "https://www.leftfieldlabs.com/",
      "startDate": "2019-11-01",
      "endDate": "2020-04-11",
      "highlights": [
        "Create and maintain responsive web applications across mutiple Google products",
        "Develop and test new features",
        "Participate in code reviews and growth sessions",
        "Debug development and production issues across multiple browsers and devices"
      ]
    },
    {
      "company": "Accomplice",
      "position": "Front End Developer",
      "website": "https://accpl.co/",
      "startDate": "2017-08-01",
      "endDate": "2019-10-01",
      "highlights": [
        "Build interactive and dynamic applications for high profile clients (Honda, AT&T, AWS, Intuit) on a fully distributed team using Angular 2+, React, AngularJS, and Vue",
        "Use scrum methodologies to meet production deadlines and plan sprints",
        "Maintain and develop features using modern development best practices and design patterns, participate in code reviews, pair programming and testing",
        "Mentoring new developers and documenting processes"
      ]
    },
    {
      "company": "Mirum",
      "position": "Front End Developer",
      "website": "https://www.mirumagency.com/",
      "startDate": "2015-09-01",
      "endDate": "2017-03-01",
      "highlights": [
        "Work with interactive team to rapidly architect, implement, and deploy sites for clients such as Walmart, Publix, and Tresemme",
        "Brand development using React, JavaScript, C#, Node.js, Asp.Net, jQuery, Grunt, and postgreSQL",
        "Promote best practices and standards while developing with bleeding edge technologies"
      ]
    },
    {
      "company": "Oppia",
      "position": "Software Engineer",
      "website": "http://oppia.org",
      "startDate": "2013-06-01",
      "endDate": "2017-10-01",
      "highlights": [
        "Designed and developed the music staff widget, a draggable/droppable interface in JavaScript & Python that I created to teach music theory intuitively",
        "TDD in Jasmine and Karma, hotfixes, feature implementation, and release documentation",
        "Partnered with a small team of Google developers to develop and test platform"
      ]
    },
    {
      "company": "Self Employed | Contractor",
      "position": "Software Engineer",
      "website": "https://oppia.org",
      "startDate": "2017-03-01",
      "endDate": "2017-08-01",
      "highlights": [
        "Rapidly build websites and custom WordPress themes for multiple clients",
        "Pixel perfect and responsive front-end implementations per designer’s mocks",
        "Regular maintenance and security updates to existing sites"
      ]
    },
    {
      "company": "Jack's Mannequin / Andrew McMahon in the Wilderness",
      "position": "Musician",
      "website": "https://www.andrewmcmahon.com/",
      "startDate": "2010-08-01",
      "endDate": "2020-04-01",
      "highlights": [
        "Toured internationally, performed, and released albums on Warner Bros",
        "Made appearances on television and radio including the Tonight Show, Conan, Jimmy Kimmel, and KROQ"
      ]
    }
  ],
  "projects": [
    {
      "name": "Google IO Save the Date",
      "description": "A highly interactive and visually exciting game built for Google developers to collaboratively reveal the dates for the upcoming Google I/O event.",
      "image": "images/google-io.png",
      "highlights": [ 
        "Built using Preact, MobX, Firebase, PixiJs, and TypeScript",
        "Praised by developers on twitter and reddit for being interactive, challening, and unable to hack"
      ],
      "keywords": [
        "Google", "IO", "Events"
      ],
      "url": "https://events.google.com/io/mission/",
      "anchor": "googleio",
      "roles": [ 
        "Front End Developer"
      ],
      "company": "Left Field Labs",
      "type": "application"
    },
    {
      "name": "AWS AI Game",
      "description": "Accomplice teamed up with Accenture to deliver an interactive game that integrated AWS’s machine learning and facial recognition at the 2017 AWS RE:INVENT convention in Las Vegas. Continuously learning from human input, the AI got smarter and smarter as AWS re:Invent went on. With every new player, it picked up new insight and became more skillful. So skillful, in fact, that we had to ultimately tweak the code to make sure it was still fun for participants to play.",
      "image": "images/aws4.jpg",
      "highlights": [ 
        "Built using Angular, Amazon Rekognition, and TypeScript",
        "Multi-player game that showcases AWS facial recognition tech",
        "Showcased at AWS convention in Las Vegas"
      ],
      "keywords": [
        "AWS", "Amazon", "AI"
      ],
      "anchor": "aws",
      "roles": [ 
        "Front End Developer"
      ],
      "company": "Accomplice",
      "type": "application"
    },
    {
      "name": "Oppia",
      "description": "Oppia is an online and open source learning tool that enables anyone to easily create and share interactive activities. These activities, called explorations, simulate a one-on-one conversation with an intelligent tutor. Oppia supports learning by doing. Your exploration can include embedded code editors, dynamic world maps, and many other options for interaction.",
      "image": "images/oppia.png",
      "highlights": [ 
        "Built using AngularJS, Python, HTML5, jQuery, Bootstrap, Protractor, and Karma",
        "Opensource and highly extensible Ed-Tech platform",
        "Maintained by a small team of Google developers"
      ],
      "keywords": [
        "Google", "Opensource", "EdTech"
      ],
      "url": "https://www.oppia.org/",
      "anchor": "oppia",
      "roles": [ 
        "Front End Developer"
      ],
      "company": "Oppia",
      "type": "application"
    }
  ],
  "education": [
    {
      "institution": "App Academy",
      "area": "Software Development",
      "studyType": "Certificate",
      "startDate": "2015-04-01",
      "endDate": "2015-08-01"
    },
    {
      "institution": "MITx",
      "area": "Software Development",
      "studyType": "Certificate",
      "startDate": "2013-09-01",
      "endDate": "2014-01-01"
    },
    {
      "institution": "Santa Monica College",
      "area": "Applied Music",
      "studyType": "AA",
      "startDate": "2005-08-01",
      "endDate": "2007-07-01"
    }
  ],
  "references": [
    {
      "name": "Anye Freer",
      "relation": "Software Architect/Direct Manager",
      "quote": "Mikey was an Angular developer on my team for about two years, our work encompassed several projects, some with much higher than average complexity. He is truly a pleasure to work with, he always has a positive 'can-do' attitude and if he doesn't know something is not afraid to ask or to research it. He is always willing to pitch in and try something new, even if it's not a true development task. He never takes constructive criticism personally; he's always willing to go back and rework a feature to make it even better, which is of course how we all improve our skills over time. He is very sociable and gets along with just about everybody - he's good with both clients and colleagues which is something I definitely can't say about every developer I've worked with! Mikey is a hard worker and a great person to have on your team and I'd really enjoy working with him again given the opportunity."
    },
    {
      "name": "Brook Hutchinson",
      "relation": "Senior Developer/Teammate",
      "quote": "Really enjoyed working with Mikey. His ability to articulate complicated Angular topics was invaluable and his understanding of Git is second to none. Mikey is a true IT Professional. He understands the importance of maintaining a positive, professional attitude in the workplace."
    }
  ],
  "skills": [
    {
      "name": "Front End Development",
      "level": "Senior",
      "keywords": [
        "ReactJS",
        "Angular",
        "AngularJS",
        "ES6",
        "JavaScript",
        "TypeScript",
        "HTML5",
        "CSS3",
        "SCSS",
        "Git",
        "Redux",
        "MobX",
        "Firebase",
        "GraphQL",
        "Ruby on Rails",
        "Node",
        "Grunt",
        "PostgreSQL",
        "Adobe Suite"
      ]
    }
  ]
}